using System.Windows;

[assembly: ThemeInfo(
    ResourceDictionaryLocation.None,            // где находятся словари ресурсов, специфичные для темы
                                                // (используется, если ресурс не найден на странице,
                                                // или в словарях ресурсов приложения)
    ResourceDictionaryLocation.SourceAssembly   // где находится общий словарь ресурсов
                                                // (используется, если ресурс не найден на странице,
                                                // в приложении или в любых словарях ресурсов, специфичных для темы)
)]